#include<stdio.h>
#include<stdlib.h>
#include<string.h>
#include<time.h>
#include"mydata.h"
typedef struct college k,*L;
char *col1[100]={{"清华大学"},{"北京大学"},{"浙江大学"},{"复旦大学"},\
{"华中科技大学"},{"南京大学"},{"武汉大学"},{"吉林大学"},\
{"上海交通大学"},{"四川大学"},{"中山大学"},{"西安交通大学"},\
{"哈尔滨工业大学"},{"山东大学"},{"中国科学技术大学"},{"天津大学"},\
{"中南大学"},{"中国协和医科大学"},{"南开大学"},{"东南大学"},\
{"同济大学"},{"北京师范大学"},{"北京航空航天大学"},{"华南理工大学"},\
{"厦门大学"},{"大连理工大学"},{"东北大学"},{"中国人民大学"},\
{"西北工业大学"},{"中国农业大学"},{"重庆大学"},{"上海第二医科大学"},\
{"中国矿业大学"},{"华东师范大学"},{"华东理工大学"},{"北京理工大学"},\
{"中国地质大学"},{"武汉理工大学"},{"苏州大学"},{"北京科技大学"},\
{"石油大学"},{"兰州大学"},{"湖南大学"},{"郑州大学"},{"上海大学"},\
{"南京理工大学"},{"南京航空航天大学"},{"南京师范大学"},{"西北农林科技大学"},\
{"南京农业大学"},{"暨南大学"},{"西南交通大学"},{"西北大学"},{"扬州大学"},\
{"西安电子科技大学"},{"电子科技大学"},{"华中师范大学"},{"华中农业大学"},\
{"首都医科大学"},{"东北师范大学"},{"湖南师范大学"},{"中南财经大学"},\
{"南京工业大学"},{"北京工业大学"},{"中国海洋大学"},{"华南师范大学"},\
{"北京交通大学"},{"中国医科大学"},{"云南大学"},{"河海大学"},{"江苏大学"},\
{"山西大学"},{"南昌大学"},{"北京化工大学"},{"华南农业大学"},{"上海财经大学"},\
{"福州大学"},{"青岛大学"},{"燕山大学"},{"山东农业大学"},{"河北大学"},\
{"福建农林大学"},{"陕西师范大学"},{"太原理工大学"},{"合肥工业大学"},\
{"东华大学"},{"广东工业大学"},{"广西大学"},{"哈尔滨工程大学"},{"昆明理工大学"},\
{"西南师范大学"},{"浙江工业大学"},{"湘潭大学"},{"河北师范大学"},{"华北电力大学"},\
{"上海师范大学"},{"山东师范大学"},{"安徽大学"},{"北京林业大学"},{"北京邮电大学"}};
void creat_list(k stu[100],int m);
void writetofileschool(struct college col[100]);
void getschool()
{
	int i=0;
	k col[100]={0};
	for(i=0;i<100;i++)
	{
		creat_list(col, i);

	}
	writetofileschool(col);

}
void creat_list(k col[100],int m)
{
	int i=0;
	int j=0;
	int pos=0;
	char * majname1[60]={{"金融与经济"},{"土木工程"},{"建筑学"},{"电子信息科学类"},\
						{"临床医学"},{"理学"},{"医学哲学"},{"经济学"},{"文学"},{"历史学"},{"法学"},\
						{"生物科学"},{"元培实验班"},{"数学"},{"物理学"},{"化学"},{"电子信息工程"},\
						{"计算机软件"},{"生命科学"},{"医学"},{"哲学"},{"管理学"},{"金融学"},{"飞行器设计与工程"},\
						{"电气工程及其自动化"},{"自动化"},{"机械设计及其自动化"},{"能源动力系及其自动化"},\
						{"会计学"},{"数学类"},{"化学类"},{"岭南学院"},{"国际商学院"},{"金融类"},{"水利类"},\
						{"测绘类"},{"新闻学"},{"人类学"},{"法医学"},{"护理学"},{"行政管理"},{"工商管理"},\
						{"数学与应用数学"},{"网络工程"},{"预防医学微电子学"},{"工商管理"},{"生物学"},{"生态学"},\
						{"电子科学与技术"},{"材料科学与工程"},{"工学"},{"农学"},{"语言文学"},{"统计学"},\
						{"基础医学"},{"光学工程学"},{"马克思主义哲学"},{"中国哲学"},{"环境与资源保护法学"},{"国际法学"}};
	
	strcpy(col[m].name,col1[m]);
	col[m].number=m+10000;
	for(i=0;i<17;i++)
	{
		  pos=rand()%(60-i);
		  strcpy(col[m].school_major.majname[i],majname1[pos]);//赋值
		  col[m].school_major.majquota[i] =30+(rand()%10);
		  for(j=pos+1;j<60-i;++j)
		  {
			  
			  majname1[j-1]=majname1[j];//覆盖
		  }
		  col[m].school_major.majnumber[i]=100*(col[m].number)+i;
		  printf("%s\t%d\t%s\t%d\t\t%d\n",col[m].name,col[m].number,col[m].school_major.majname[i],col[m].school_major.majnumber[i],
		  col[m].school_major.majquota[i]);
		
	}
	

	
}
void writetofileschool(struct college col[100])
{
	int i = 0;
	int m=0;
	FILE * college_list = NULL;
	college_list = fopen("C:\\college_list.txt","wb");
	if(college_list==NULL)
	{
		printf("File cannot open");
		exit(0);
	}
	for(m=0;m<100;m++ )
	{
		/*for(i=0;i<17;i++)
		{
		    fprintf(college_list,"%s\t%d\t%s\t%d\t%d\n",col[m].name,col[m].number,col[m].school_major.majname[i],col[m].school_major.majnumber[i],
		     col[m].school_major.majquota[i]);
		}*/
		fwrite( &col[m], sizeof(col[0]), 1, college_list);

	}
	fclose(college_list);

	

}